{
  "4": {
    "label": "yellow rice borer",
    "original_knowledge": "Chilo suppressalis, the Asiatic rice borer or striped rice stemborer, is a moth of the family Crambidae. It is a widespread species, known from Iran, India, Sri Lanka, China, eastern Asia, Japan, Taiwan, Malaysia to the Pacific.",
    "visual_knowledge": "The yellow rice borer, scientifically known as *Chilo suppressalis*, is a moth that can be identified by its distinctive visual features. In its adult moth stage, the yellow rice borer has a wingspan of approximately 18-28 mm. The forewings of the adult moth are typically a pale yellow or straw color, often with a slight sheen, and adorned with a series of longitudinal, parallel, darker stripes that are tan to brown in color. These stripes can be key identifying factors, along with the rounded wing shape. The hindwings are lighter, often appearing whitish or light grey with less distinct markings.\n\nThe moth's body is slender and matches the pale coloration of the wings, with slightly darker striping along the abdomen which helps blend with its backdrop habitat. This coloration provides camouflage among rice plants and stems, its primary habitat. Notable is the moth's thorax, which holds a small tuft of hair that aligns with the light-colored palette. When at rest, the yellow rice borer's wings are typically held flat, which aligns all stripes, creating a continuous lined pattern.\n\nIn its larval stage, the yellow rice borer appears as a caterpillar with a creamy white or pale yellow body. The larvae are about 20-30 mm in length at full development and have a series of faint reddish-brown longitudinal stripes along the length of their bodies, matching in some regards to the pattern on the adult's wings but less pronounced. The head capsule of the larvae is brown, and they exhibit a characteristic segmented body common to caterpillars.\n\nIn contrast to similar species, such as the rice stem borer (*Scirpophaga incertulas*), which has a more consistent yellow color without distinctive striping, the yellow rice borer's striped pattern is crucial for differentiation. Additionally, images depicting larvae feeding inside the rice stems, or those with frass (insect excrement), may assist identification, as these are typical indicators of the pest's presence and activity.\n\nVisual recognition should also consider the moth's propensity to appear around rice fields or similar grassy, plant-dense environments. The typical setting may include images of rice paddies, where these moths might be seen resting on the foliage or in flight during dusk, when they are most active. The lifecycle stages from egg, larva, pupa to adult each present different visual markers, and recognizing the landscape context can significantly aid in accurate identification.",
    "url": "https://en.wikipedia.org/wiki/Chilo_suppressalis"
  },
  "15": {
    "label": "mole cricket",
    "original_knowledge": "Grub is either another word for the larva of the beetle superfamily Scarabaeoidea or a slang term for food. It can also refer to:",
    "visual_knowledge": "Mole crickets are distinctive insects known for their robust and specialized physical structures, which make them visually identifiable in images. The body of a mole cricket is cylindrical and elongated, typically ranging from 3 to 5 centimeters in length. These insects have a predominantly brown to dark brown coloration, though some might exhibit lighter, almost tan shades. Their anatomy is quite robust, and they are covered in fine, velvety hairs, giving them a slightly fuzzy appearance. One of their most distinguishing features is their forelegs, which are highly modified for digging. These fore legs resemble those of a mole, hence the name, and are broad, ridged, and spade-like with sharp claws.\n\nThe body of a mole cricket comprises three main parts: the head, thorax, and abdomen. The head is small in proportion to the rest of the body, equipped with two long antennae and compound eyes. The thorax is segmented and houses the powerful musculature required to operate the digging forelegs. The abdomen is relatively long, tapering towards the rear, with visible segmentation. The wings of a mole cricket lay flat against the body when at rest; however, they can be cumbersome and ineffective for flight, often used more for short, gliding hops rather than sustained flight.\n\nWhen comparing mole crickets to similar insects, their forelimbs set them apart from grasshoppers and crickets, who possess longer, more slender legs designed for jumping rather than burrowing. Their body is bulkier and lacks the exaggerated hind legs seen in other cricket species. Additionally, mole crickets lack the pronounced sounds commonly associated with their more musical relatives.\n\nIn images, mole crickets are often seen in natural environments such as loose, sandy soils or under stones and logs, frequently associated with moist and damp habitats, as they prefer areas conducive to their digging behavior. Their burrows and tunnels may also be visible, characterized by upturned soil that resembles miniature molehills.\n\nRegarding life cycle stages, mole cricket nymphs resemble smaller versions of adults but without the fully developed wings. Early stage nymphs lack wings entirely, while intermediate stages show wing buds. Each developmental stage maintains the distinct, mole-like forelimbs and overall morphological characteristics, enabling visual recognition across the life cycle continuum.",
    "url": "https://en.wikipedia.org/wiki/Grub"
  },
  "16": {
    "label": "wireworm",
    "original_knowledge": "Mole crickets are members of the insect family Gryllotalpidae, in the order Orthoptera. Mole crickets are cylindrical-bodied, fossorial insects about 3–5 cm (1.2–2.0 in) long as adults, with small eyes and shovel-like fore limbs highly developed for burrowing. They are present in many parts of the world and where they have arrived in new regions, may become agricultural pests.",
    "visual_knowledge": "Wireworms are the larval stage of click beetles, and they exhibit distinct visual characteristics that aid in their identification. The larvae are typically elongated, slender, and cylindrical, resembling a wire, which is where they get their common name. Wireworms can range in size from about 10 to 30 millimeters in length depending on their growth stage. Their bodies are segmented and relatively hard, contributing to their durability and giving them a glossy appearance. \n\nIn terms of color, wireworms are generally a yellowish-brown or an amber hue, although some can appear slightly darker or more orange. Their heads are slightly darker than the rest of the body, which contrast with the lighter segments that make up their thorax and abdomen. The head is equipped with prominent, small mandibles used for feeding, and there are simple eyes that are often difficult to distinguish.\n\nThe body of a wireworm can be visually divided into three main parts: the head, thorax, and abdomen. The most distinctive part is the thorax, which accounts for about a third of its body length and connects directly to the elongated abdomen, characterized by its repetitive segments. At the posterior end, wireworms have a pair of small, non-prominent cerci, which are appendages that vary slightly in appearance between species.\n\nDistinguishing wireworms from other similar larvae, such as those of scarabs or coleopterans, includes noting their more rigid and uniformly narrow form. Unlike the more commonly C-shaped white or cream white grubs, wireworms maintain a straight and tubular form even when inactive. \n\nWireworms are often found in soil habitats, particularly in agricultural settings and gardens, as they feed on roots and organic matter. Images may capture them among plant roots, in field furrows, or emerging from tilled soil, suggesting their role in the ecosystem and providing clues to their potential presence.\n\nRegarding their life cycle, the wireworm stage is the primary representation in developmental imagery. Adult click beetles, in contrast, are more beetle-like, with elongated bodies that are darker and have somewhat flattened, elongated shapes that can click when flipped over, but these qualities do not apply to the larval wireworm stage.",
    "url": "https://en.wikipedia.org/wiki/Mole_cricket"
  },
  "17": {
    "label": "white margined moth",
    "original_knowledge": "Elateridae or click beetles are a family of beetles. Other names include elaters, snapping beetles, spring beetles or skipjacks. This family was defined by William Elford Leach (1790–1836) in 1815. They are a cosmopolitan beetle family characterized by the unusual click mechanism they possess. There are a few other families of Elateroidea in which a few members have the same mechanism, but most elaterid subfamilies can click. A spine on the prosternum can be snapped into a corresponding notch on the mesosternum, producing a violent \"click\" that can bounce the beetle into the air. The evolutionary purpose of this click is debated: hypotheses include that the clicking noise deters predators or is used for communication, or that the click may allow the beetle to \"pop\" out of the subtrate in which it is pupating. It is unlikely that the click is used for avoiding predators as it does not carry the beetle very far (<50cm), and in practice click beetles usually play dead or flee normally. There are about 9300 known species worldwide, and 965 valid species in North America.",
    "visual_knowledge": "The white margined moth can be visually identified by its distinct coloration and markings. Its wings are primarily brown or grayish-brown, often adorned with subtle, intricate patterns that contribute to camouflage against tree bark and leaves. Most notably, the moth has a distinctive white margin outlining the edges of its wings, which helps in differentiating it from similar moth species. This white border is typically the most striking feature when trying to visually identify the moth in images.\n\nThe body structure of the white margined moth includes a standard moth shape with forewings and hindwings tucked when at rest, creating a triangular silhouette. The wings have a smooth, scaled texture common to moths, with a slight sheen that might be visible in reflective light. Key identifiers also include its antennae, which are usually straight or slightly feathered, less pronounced compared to many other moth species, offering clues when observing close-up images.\n\nComparatively, the white margined moth should be differentiated from similarly sized moths like the cabbage moth or the gypsy moth, which lack the continuous white edging. The moths in the same habitat may also have more vibrant colors or lack the intricate edge designs, helping distinguish the white margined moth in mixed settings.\n\nIn terms of habitat context, images might depict the white margined moth resting on tree trunks, leaves, or among foliage where its coloration mimics the surroundings for camouflage. This moth can sometimes be spotted in environments ranging from dense woods to urban gardens, often in areas with an abundance of shrubbery and tree cover.\n\nDuring its life cycle, while the adult stage is the most visually identifiable due to its wings and size, the larvae of white margined moths are less visually distinctive, generally appearing as green or brown caterpillars. As an adult, its nocturnal behavior means it is most often seen in outdoor lighting or near light sources at night, a useful context when identifying them in nocturnal image captures.",
    "url": "https://en.wikipedia.org/wiki/Click_beetle"
  },
  "19": {
    "label": "large cutworm",
    "original_knowledge": "Agrotis ipsilon, the dark sword-grass, ipsilon dart, black cutworm, greasy cutworm or floodplain cutworm, is a small noctuid moth found worldwide. The moth gets its scientific name from black markings on its forewings shaped like the letter \"Y\" or the Greek letter upsilon. The larvae are known as \"cutworms\" because they cut plants and other crops. The larvae are serious agricultural pests and feed on nearly all varieties of vegetables and many important grains.",
    "visual_knowledge": "### Visual Appearance:\nThe large cutworm, also known as Agrotis ipsilon, exhibits distinct visual characteristics across its life cycle stages. The adult moth has a wingspan ranging from about 4 to 5 centimeters, featuring forewings that are predominantly a mottled brown or dark gray color. A key identifier is the presence of black markings shaped like the letter \"Y\" or the Greek letter upsilon on each forewing. These markings are a crucial distinguishing feature. The hindwings are comparatively lighter, often appearing silver-gray with fringed edges.\n\n### Body Structure and Parts:\nThe moth is characterized by a robust body typical of noctuid moths. It has relatively elongated and narrow wings when viewed in a resting position, forming a triangular shape. The body is covered in fine scales, which give it a somewhat smooth, slightly shiny appearance. The antennae are threadlike, typical of moths, aiding in its identification when observed closely in images.\n\n### Comparative Features:\nWhen differentiating large cutworms from similar noctuid species, the black \"Y\" markings on the forewings are the most striking feature. In contrast, similar species might display different patterns or lacking these specific black marks, aiding in quick visual distinction.\n\n### Habitat Context:\nIn images, the large cutworm is often found in agricultural settings, favoring areas with abundant vegetation. The adult moth might be seen resting on plants, soil, or feeding on nectar from flowers at night. The larvae are typically found near the base of plant stems, often hidden in soil, curling into a C-shape when disturbed.\n\n### Life Cycle Stages:\n1. **Larva (Caterpillar):** The larva stage, referred to as the cutworm, can be identified by its plump, smooth-bodied appearance, usually in shades of gray to brown, sometimes with faint lateral stripes. The larvae might be depicted in images as feeding on stems at ground level, cutting through young plants.\n   \n2. **Pupa:** The pupal stage may show the insect as a hard, brown, and smooth capsule-like structure, often buried slightly in soil.\n\n3. **Adult Moth:** Distinct visual markers in images include the aforementioned wings with black markings, and the resting position which provides a classic moth profile.\n\nUnderstanding these visual descriptions, especially the unique patterns and environment, facilitates accurate identification of the large cutworm in varied imagery settings.",
    "url": "https://en.wikipedia.org/wiki/Agrotis_ipsilon"
  },
  "22": {
    "label": "corn borer",
    "original_knowledge": "Tetranychus urticae is a species of plant-feeding mite generally considered to be a pest. It is the most widely known member of the family Tetranychidae or spider mites. Its genome was fully sequenced in 2011, and was the first genome sequence from any chelicerate.",
    "visual_knowledge": "The corn borer, specifically the European corn borer (Ostrinia nubilalis), can be visually identified by several key characteristics across its life stages.\n\n**Visual Appearance:**\nAdult moths have a wingspan ranging from 20 to 25 mm. Their forewings are a pale tan or light brown color, often with fine lines and a spotted or wavy pattern that varies somewhat among individuals. Males tend to have darker, more pronounced markings than females. The hindwings are lighter, typically an off-white or very pale yellow, with little patterning.\n\n**Body Structure and Parts:**\nThe adult moth’s body is slender and typically matches the tan coloration of its forewings, providing camouflage in its natural habitat. Antennae are filamentous and suitable for detecting pheromones, and the legs are adapted for crawling.\n\n**Comparative Features to Similar Insects:**\nOne way to distinguish the corn borer from similar moths is by its specific pattern of faint lines on the forewings and its relatively small size when compared to larger moth species. In contrast, similar looking moths like those in the Pyralidae family, such as the sod webworm, often display more conspicuous and varied wing patterns.\n\n**Habitat Context:**\nImages of corn borers are often taken in agricultural contexts, especially cornfields, where they are considered pests. They might be photographed on corn stalks, particularly alongside the midribs of leaves or near the silks, often at rest. This context can help differentiate them from other similar insects.\n\n**Life Cycle Stages:**\nLarvae of the corn borer are the most distinct visually. They are caterpillar-like, approximately 20-25 mm in length when mature, and exhibit a light brown to pinkish color with small, dark spots along their bodies. They have a dark head capsule. The eggs of the corn borer are laid in clusters, usually on the underside of corn leaves, appearing as flattened, fish scale-like structures that are white when first laid and darken just before hatching.\n\nIdentifying these stages and features in images will be crucial for a recognition system focused on the corn borer, enabling accurate differentiation from other similar species.",
    "url": "https://en.wikipedia.org/wiki/Tetranychus_urticae"
  },
  "23": {
    "label": "army worm",
    "original_knowledge": "Ostrinia is a genus of moths in the family Crambidae described by Jacob Hübner in 1825. Several of them, including the European corn borer, are agricultural pests.",
    "visual_knowledge": "To effectively identify the army worm (specifically the fall armyworm, Spodoptera frugiperda, and the African armyworm, Spodoptera exempta), an image recognition system should be trained on several distinct visual characteristics:\n\n1. **Visual Appearance**: Army worms are caterpillars with a smooth, cylindrical body averaging about 1.5 to 2 inches in length when fully grown. Their coloration is typically a mix of browns, greens, and yellows which provide camouflage against their leafy habitats. They often exhibit a distinct longitudinal pattern along their bodies. Notably, they possess a series of light-colored stripes running down their dorsal and lateral sides. A key identification feature is an inverted \"Y\" shape on the head capsule, which is darker than the surrounding head color.\n\n2. **Body Structure and Parts**: The body of an army worm is segmented, with the head being distinctly rounded and often a contrasting color to the body, usually a darker hue such as brown or black. The thoracic segments immediately following the head might have small spots visible across several segments. They have a set of prolegs (short, fleshy, stub-like structures) extending from the abdominal midsection, which helps them in locomotion, and are tipped with tiny hooks known as crochets.\n\n3. **Comparative Features to Similar Insects**: Compared to similar pest caterpillars like the corn earworm or cutworms, the army worm's unique inverted \"Y\" on its head is a distinguishing mark. Additionally, the presence of a series of circular dots or spots located dorsally on each segment can help differentiate them. Compared to other caterpillars, they may appear smoother due to less pronounced setae (hair structures).\n\n4. **Habitat Context in Images**: Army worms are often associated with agricultural fields, notably corn, rice, or other grain crops, as well as grassy areas. They are typically seen on or under the leaves, which might show signs of damage such as irregular holes or edges chewed down to the leaf midrib. Images may also capture them on soil surfaces, especially during migrations.\n\n5. **Life Cycle Stages with Distinct Visual Characteristics**: Images should account for various life cycle stages, with the larval stage (caterpillar) being the most distinct and recognizable. The pupal stage sees the larvae becoming brownish, bean-shaped cocoons often hidden in the soil or debris. Adults are moths with a wingspan of about 1.3 to 1.5 inches, gray to brown in color, and may not show as many distinguishing marks outside specific patterning on the wings, such as a light and dark brown mottling and a small white spot in the center of each forewing.\n\nTraining an image recognition system with these visual features can significantly enhance its ability to accurately identify the army worm in diverse environments captured in imaging.",
    "url": "https://en.wikipedia.org/wiki/Ostrinia"
  },
  "24": {
    "label": "aphids",
    "original_knowledge": "Armyworms are the caterpillars of some members of two genera:Many Spodoptera including:\nAfrican armyworm (Africa)\nFall armyworm \nLawn armyworm \nSome Mythimna (moth) including:\nCommon armyworm or true armyworm \nNorthern armyworm, Oriental armyworm or rice ear-cutting caterpillar (Asia)\n",
    "visual_knowledge": "Aphids are small, soft-bodied insects that can be identified by several key visual features. They typically measure between 1 to 10 millimeters in length. Their bodies are pear-shaped and plump, with a notable pair of long antennae that protrude from the head, often reaching about half their body length. Aphids are highly variable in color, including shades of green, yellow, brown, red, and black. This color variability is a significant visual identification feature as it may change depending on their host plant or environmental conditions.\n\nOne of the most distinctive morphological features of aphids is the presence of two tube-like structures called cornicles or siphunculi, situated on the posterior end of their abdomen. These are typically dark and noticeable, even from a side view, contrasting with the rest of their body. The cornicles are often considered a crucial identification marker for distinguishing aphids from other similar small insects.\n\nAphids generally have a segmented body with clear distinction between the head, thorax, and abdomen. Their legs are slender and adapted for clinging to plant surfaces, and although wings may be present in some, these are typically folded flat on the back and are clear with noticeable veins when visible. Some aphids, especially in certain life stages or during overcrowded conditions, develop wings, which allows them to migrate to new plant hosts.\n\nIn terms of comparative features, aphids may be confused with other minute plant-feeding insects like psyllids or scale insects. However, the presence of cornicles and the softer body segmentation rather than the hardened or armored appearance of scale insects can help differentiate aphids. Psyllids often have a more robust and rounded body with behavioral characteristics such as jumping, which aphids generally do not display.\n\nAphid habitats in images usually include dense clusters on the undersides of leaves, stems, or flower buds of their host plants. They are frequently seen on a wide variety of plants, indicating their preference for plant-rich environments. Images capturing their typical clusters will often show a group of aphids tightly grouped, sometimes being attended by ants that farm them for honeydew, a sugary substance they excrete.\n\nThe visual stages of an aphid’s life cycle include nymphs and adults, which resemble each other except for size. Nymphs are generally smaller and wingless but share the same body shape and coloration as the adults. Additionally, during certain life cycle phases, such as when they develop wings in response to environmental cues, aphids can take on a noticeably different appearance, with some visual emphasis on wing venation and the elongated structure around the thorax where wings attach.\n\nThese detailed visual characteristics should aid any image recognition or classification system in accurately identifying aphids in varied photographic or illustrative contexts.",
    "url": "https://en.wikipedia.org/wiki/Armyworm"
  },
  "25": {
    "label": "Potosiabre vitarsis",
    "original_knowledge": "Aphids are small sap-sucking insects and members of the superfamily Aphidoidea. Common names include greenfly and blackfly, although individuals within a species can vary widely in color. The group includes the fluffy white woolly aphids. A typical life cycle involves flightless females giving live birth to female nymphs—who may also be already pregnant, an adaptation scientists call telescoping generations—without the involvement of males. Maturing rapidly, females breed profusely so that the number of these insects multiplies quickly. Winged females may develop later in the season, allowing the insects to colonize new plants. In temperate regions, a phase of sexual reproduction occurs in the autumn, with the insects often overwintering as eggs.",
    "visual_knowledge": "Potosiabre vitarsis, often known as a type of scarab beetle, is visually distinctive and can be identified through several key characteristics. The beetle typically exhibits a robust, compact shape characteristic of scarabs, with a strongly convex body. Its size ranges from medium to large for beetles, generally measuring about 15 to 25 millimeters in length, which makes it more readily visible in images.\n\nThe coloration of Potosiabre vitarsis is a striking feature, often displaying metallic hues. The elytra (wing covers) can range from a vibrant metallic green to copper or golden tones, which may exhibit iridescence depending on the angle of light. This metallic sheen is a key identifying feature that makes the beetle stand out against many backgrounds. The thorax often matches or complements this coloration, and the legs typically have a metallic luster as well, sometimes appearing a shade darker.\n\nThe body of Potosiabre vitarsis is partitioned into the segmented head, thorax, and abdomen, with distinct markings or textures visible on each part. The head of the beetle is small relative to the body, with antennae that have a clubbed shape and typically appear short. It has noticeable, well-developed mandibles visible when viewed from a frontal perspective.\n\nComparatively, Potosiabre vitarsis can be confused with other metallic beetles; however, its slightly larger size, specific color patterns, and the smoothness of the elytra can help differentiate it. Unlike some other beetles that may have spots or grooves, this beetle generally exhibits a smoother appearance across its back.\n\nIn images depicting its habitat, Potosiabre vitarsis is often seen in environments with abundant foliage as they frequently inhabit areas where they can feed on plant matter or decomposing organic material. This beetle often appears on leaves, making the green hues of its body blend somewhat with its leafy surroundings. \n\nRegarding its life cycle, the larval stage of the beetle, often referred to as a grub, is distinct and may occasionally be visible in image settings depicting soil or decomposing wood. These larvae are C-shaped, cream-colored with a dark head, and lack the metallic sheen of their adult counterparts. They primarily inhabit the soil where they feed on roots, but during controlled or disturbed settings, such as after heavy rain, they may be exposed and visible.\n\nThus, in images, the visual identification of Potosiabre vitarsis should focus on the interplay of its distinctive metallic hues, body shape, and the smooth surface of its elytra, considering its typical leafy or decomposing wood habitat.",
    "url": "https://en.wikipedia.org/wiki/Aphid"
  },
  "28": {
    "label": "green bug",
    "original_knowledge": "Sitobion avenae, the English grain aphid, is an aphid in the superfamily Aphidoidea in the order Hemiptera. It is a true bug and sucks sap from plants. It lives on grasses, sedge and rushes and can be a significant pest of cereals.",
    "visual_knowledge": "The English grain aphid, or Sitobion avenae, commonly referred to as a \"green bug,\" exhibits a predominantly bright green coloration, which can be a key identifying feature in images. Their body shape is elongated and oval, usually ranging from 1.5 to 3 mm in length, and they have a soft, pear-shaped body. The aphid's green hue might vary slightly depending on environmental conditions but tends to be quite vibrant, providing stark contrast against the surfaces of grasses and cereal plants they infest.\n\nThe body structure consists of six slender, pointed legs and two long antennae that are almost as long as their body, which aids in communication and navigation. On the posterior end of their body, green bugs have a pair of visible cornicles or siphunculi, which are tubular structures that excrete defensive fluids – these typically appear as darkened spots. Their mouthpart is needle-like (stylet) and designed for piercing plant tissues and extracting sap, though this is not often visible in images unless captured in a feeding position.\n\nWhen comparing to similar insects, green bugs might be confused with other types of aphids. However, their bright green color and the presence of the darkened cornicles are distinguishing factors. Unlike some aphid species that may appear brown, black, or multi-colored, Sitobion avenae tends to maintain a consistent hue that aids in their identification.\n\nImages capturing their habitat would typically show them on various grasses, including wheat, oats, and barley, in agricultural settings. The presence of these insects on cereal crops can often be identified by clusters feeding near the base of stems or on the underside of leaves, contributing to the visual context.\n\nDuring their life cycle, green bugs exhibit winged and wingless forms. The wingless form is more commonly seen, with the aforementioned body features. However, winged forms might appear when colonies decide to migrate or environmental conditions change. These winged stages have a set of translucent wings with obvious veination, which can fold back over their bodies when not in use, giving them a slightly different profile.\n\nThis detailed characterization should aid an image recognition system in distinguishing green bugs from other similar insect species, particularly in environments associated with cereal plants and grasses.",
    "url": "https://en.wikipedia.org/wiki/Sitobion_avenae"
  },
  "32": {
    "label": "longlegged spider mite",
    "original_knowledge": "Penthaleus major, known generally as the winter grain mite or blue oat mite, is a species of earth mite in the family Penthaleidae. They are black or dark blue in color and are widespread across the world. They are commonly found on oats and in pastures and spend most of their time on the surface of soil, and are occasionally found on wheat, barley, peas, lentil and lucerne, and seldom on canola.",
    "visual_knowledge": "To accurately identify the longlegged spider mite visually in images, focus on the following detailed aspects:\n\n1. **Visual Appearance:**\n   - **Color:** The longlegged spider mite typically presents a reddish or orange hue, which can vary slightly depending on environmental factors and the mite's life stage. The body may appear almost translucent in some light conditions, accentuating its reddish tint.\n   - **Size:** These mites are minute, often measuring less than a millimeter in length. The size might require macro-level imaging to view clearly in an image.\n   - **Shape:** The body structure is oval or slightly elongated, compact yet proportionally broad compared to the length. The dorsal view shows a somewhat flattened appearance with a subtle dorsal patterning.\n\n2. **Body Structure and Parts:**\n   - **Legs:** As the name suggests, longlegged spider mites feature notably elongated legs relative to their body size. These legs are typically faintly segmented and can be darker than the body, contributing to their distinctive appearance.\n   - **Body Patterns:** The dorsal side often shows faint speckles or mottling, with some individuals displaying subtle striping or spot patterns, which can aid in distinguishing this mite in close-up photography.\n\n3. **Comparative Features:**\n   - Compared to other common mite species, such as the two-spotted spider mite, longlegged spider mites do not generally display the pronounced twin spots. Instead, their longer legs and lack of significant spot markings help differentiate them from similar species.\n\n4. **Habitat Context:**\n   - In images, longlegged spider mites are frequently seen on the undersides of leaves or amidst the webbing they produce. The webbing is silk-like and fine, often creating a sheen overlay when photographed at certain angles.\n   - They might also be found on and around the soil surface, especially in residential areas with ornamental plants or agricultural settings where they target crop foliage.\n\n5. **Life Cycle Stages:**\n   - **Larvae:** The early stages are paler with less-pronounced body patterns, appearing almost colorless with a soft hue which darkens as it matures.\n   - **Nymphs:** These resemble adults but are smaller, with developing legs which may look disproportionate compared to their compact body size. Their color is often a lighter, less saturated tone.\n   - **Adults:** Fully mature adults are more vibrant in color, with more defined legs and body patterns, making them more visually distinctive in images.\n\nBy focusing on these characteristics, an image recognition system can better identify and differentiate the longlegged spider mite from similar species in various environmental contexts and stages of its life cycle.",
    "url": "https://en.wikipedia.org/wiki/Penthaleus_major"
  },
  "38": {
    "label": "cabbage army worm",
    "original_knowledge": "The flea beetle is any small, jumping beetle of the leaf beetle family (Chrysomelidae) that is part of the tribe Alticini, which is part of the subfamily Galerucinae. Historically the flea beetles were classified as their own subfamily.",
    "visual_knowledge": "The cabbage army worm, often found in agricultural contexts, exhibits several distinct visual characteristics that make it identifiable in images. In its larval stage, the worm is generally elongated with a cylindrical body that measures approximately 25 to 35 millimeters in length. The body is predominantly green, camouflaging it well among the foliage. A closer inspection reveals a pattern of faint white or yellowish lines running laterally down its body, giving it a subtle striped appearance. These lines can be a key distinguishing mark. The head is small, rounded, and slightly darker than the rest of the body, often a brown or yellowish-brown.\n\nThe body structure of the cabbage army worm is segmented, typical of caterpillars, featuring three thoracic segments with three pairs of true legs and several prolegs along its abdomen that provide mobility. The prolegs are equipped with small, hook-like structures called crochets that aid in gripping plant material. The texture of its body appears smooth, lacking significant setae (bristles) or protrusions visible in some other larvae.\n\nIn comparison to similar caterpillars, the cabbage army worm's lack of significant hair coverage and its continuous green coloration can help differentiate it from more bristly or variably colored species. Unlike the similar cabbage looper, the cabbage army worm does not exhibit a looping motion when moving; it moves in a more straightforward, crawling manner.\n\nHabitat images may reveal cabbage army worms on the undersides of leaves or hidden within the foliage of host plants such as cabbage, broccoli, and other cruciferous vegetables. These caterpillars blend into leafy greens, making their detection challenging without careful observation. Leaves may show signs of damage, such as holes or ragged edges, indicative of feeding activity.\n\nRegarding life cycle stages, the cabbage army worm undergoes complete metamorphosis. While the larval stage is most prominently recognizable and damaging to crops, the adult stage appears as a small, inconspicuous moth. The adult moth is typically grayish-brown with a wingspan of about 30 to 35 millimeters. It has forewings marked with indistinct dark spots or wavy lines, though these features are less vital for larval identification.\n\nBy focusing on these key visual characteristics, including color, body structure, and behavior, an image recognition system can effectively identify cabbage army worms and differentiate them from similar species.",
    "url": "https://en.wikipedia.org/wiki/Flea_beetle"
  },
  "45": {
    "label": "flax budworm",
    "original_knowledge": "Hypera postica, commonly known as the alfalfa weevil, is a species of weevil; it can be found in alfalfa fields throughout Europe. Considered a destructive threat to alfalfa production in North America, several accidental introductions have been successfully countered though the use of a variety of biological control species.",
    "visual_knowledge": "The flax budworm is a small caterpillar recognized for its distinct body structure and visual features that make it identifiable in images. It typically measures around 12 to 20 mm in length when fully grown. The body is slender and cylindrical, often displaying a characteristic coloration that aids in its identification. A key visual feature of the flax budworm is its light green to olive-green body, which may have a slightly darker green dorsal line running longitudinally along its back. This dorsal line might be accompanied by faint, lighter lateral lines on either side, which can be an important distinguishing feature.\n\nThe body is segmented, and close observation of these segments reveals small, black or brownish spots that sometimes appear in pairs. These spots may form a pattern that helps differentiate the flax budworm from similar larvae. Each segment may also be adorned with fine hairs, though these are typically more subtle and less discernible in images unless magnified.\n\nWhen examining the head, the flax budworm exhibits a small, rounded, and smoothly contoured head capsule. The head is usually a tan or yellowish-brown color, contrasting slightly with the green body. The mouthparts are adapted for chewing, typical of caterpillars, though details of these parts might not be visible in standard images. Antennae are short and not easily noticeable but present.\n\nComparatively, the flax budworm can be mistaken for other green caterpillars, like those of closely related species. However, the specific pattern and coloration—particularly the presence and arrangement of the dorsal and lateral lines—are critical for accurate differentiation.\n\nIn habitat context, images may often capture the flax budworm within flax plants, where they blend in due to their green coloration. They may be found along the flower buds and foliage, which can serve as a clue in images. The association with flax fields or areas abundant with flax plants might provide context clues in photographs, aiding in correct identification.\n\nDuring its life cycle, the flax budworm undergoes several distinct stages, with the larval stage being the most visually recognizable and photographed. While eggs and pupa stages might be less visually distinctive, images of potential pupae might show a cocoon-like structure where the caterpillar transitions to adulthood, often brown or whitish and attached to plant surfaces.\n\nBy focusing on these details—coloration patterns, body segmentation, head structure, and common environmental contexts—an image recognition system can effectively identify and classify the flax budworm in images.\n",
    "url": "https://en.wikipedia.org/wiki/Hypera_postica"
  },
  "47": {
    "label": "tarnished plant bug",
    "original_knowledge": "Adelphocoris lineolatus, is commonly known as the Lucerne bug or the alfalfa plant bug, and belongs to the family Miridae. It is an agricultural pest causing vast amounts of damage to numerous crops, but primarily to alfalfa crops around the globe.",
    "visual_knowledge": "The tarnished plant bug (Lygus lineolaris) features a distinctive and varied coloration that plays a crucial role in its visual identification. The insect exhibits a brownish or mottled appearance, with its body typically displaying shades of green, brown, yellow, and reddish tones, often interspersed with darker markings. The overall appearance can give the insect a camouflaged look against its natural environment, such as plant foliage or stems.\n\nThis insect is approximately 5 to 6 millimeters in length, with an elongated oval-shaped body that tapers towards the rear. The bug's head is comparatively small, and it has prominent compound eyes that can appear red or dark in some lighting. Adult tarnished plant bugs typically have long, slender antennae that are segmented and can be nearly as long as their body, which they use for sensing their surroundings.\n\nOne of the most distinguishing marks on the tarnished plant bug is the presence of a light-colored \"V\" or \"Y\" shaped marking located on the upper back or scutellum (the triangular area at the base of the wings). This marking stands out against the bug’s generally darker thorax and can be a critical identifying feature. Additionally, the wings are membranous toward the tips and positioned flat over the body, with visible veins contributing to the insect's mottled appearance.\n\nWhen compared to similar bugs, the tarnished plant bug can be differentiated by this characteristic V-shaped marking, unlike its relative insects, which may lack these distinct patterns or have different coloration. Its size and shape distinguish it from other plant bugs or aphids, which might be smaller or of different hues.\n\nImages of their habitat context often show them on flower heads, buds, or young plant shoots. They frequently inhabit areas with dense vegetation, particularly those plants that are part of agricultural settings like alfalfa, clover, or cornfields. This context is pivotal in identifying the insect within an image accurately.\n\nLife cycle stages also present distinct visual characteristics. Nymphs, which are the immature stages, are typically smaller and may appear greener than adults. They lack fully developed wings, which gradually develop as they mature, often displaying a light green color with fewer visible markings compared to adults, making them look slightly different visually.\n\nIn identifying the tarnished plant bug, these distinctive visual attributes collectively play a significant role in distinguishing it from similar insects within its environment.",
    "url": "https://en.wikipedia.org/wiki/Adelphocoris_lineolatus"
  },
  "48": {
    "label": "Locustoidea",
    "original_knowledge": "The tarnished plant bug (TPB), Lygus lineolaris, is a species of plant-feeding insect in the family Miridae. It has piercing-sucking mouthparts and has become a serious pest on small fruits and vegetables in North America. It is considered a highly polyphagous species and feeds on over half of all commercially grown crop plants, but favors cotton, alfalfa, beans, stone fruits, and conifer seedlings. A study done in southwestern Quebec, Canada has investigated the presence of L. lineolaris in a commercial vineyard. This study also indicated that weeds that grow from cultivation of crops serve as an important food source for L. lineolaris. This insect can be found across North America, from northern Canada to southern Mexico. Adults grow up to 6.5 mm in length, and are brown with accents of yellow, orange or red, with a light-colored \"V\" on the back (dorsal). The genome has recently been sequenced for the first time.",
    "visual_knowledge": "**Visual Appearance (Color, Size, Shape, Distinguishing Marks):**\n\nThe Locustoidea, commonly known as locusts, typically exhibit coloration ranging from shades of green to brown, with some species showcasing yellow or red markings. These color variations often serve as camouflage against their natural surroundings, such as grass or soil. Adult locusts are medium to large-sized insects, generally ranging from about 30 to 60 millimeters in length. They possess a slender, elongated body that is built for jumping and gliding. Notably, locusts often have enlarged hind legs that are muscular and adapted for powerful leaps. Distinctively, some locusts may display dark striping or mottled patterns on their wings and bodies, which can aid in visual recognition.\n\n**Body Structure and Parts:**\n\nLocusts have a body divided into three main parts: the head, thorax, and abdomen. The head is relatively small with large, prominent compound eyes that provide a wide field of vision—a key feature for identifying these insects. They have short, segmented antennae and possess a set of strong, chewing mandibles used for feeding on leaves and other plant materials. The thorax is robust and supports two pairs of wings; the front pair is more rigid and serves as a protective cover for the hind wings, which are broader and used for flight. The abdomen is segmented and flexible, enabling movement and facilitating egg-laying in females.\n\n**Comparative Features to Similar Insects:**\n\nWhile locusts might be confused with grasshoppers, they can be differentiated by their swarming behavior and the noticeable shape of their hind wings, which are more suited for sustained flight. Locusts also tend to have a more prominent \"hump\" on the pronotum (a shield-like structure covering part of the thorax) compared to the generally flatter pronotum of grasshoppers.\n\n**Habitat Context That Might Appear in Images:**\n\nImages of locusts are often set in open habitats such as grasslands, deserts, or agricultural fields. They might be seen in large groups, especially during swarming events, which is a hallmark of their behavior. Vegetation like grass, crops, or shrubs surrounds locusts in these images, as these are their primary feeding sites. Locusts at rest may be seen clinging vertically to stems or horizontally sitting on the ground.\n\n**Life Cycle Stages with Distinct Visual Characteristics:**\n\nIn the life cycle of locusts, the nymph stage is distinct, appearing smaller and without fully developed wings, instead exhibiting wing buds. These juvenile forms are often referred to as 'hoppers'. As they mature, locusts undergo several molts, gradually acquiring full wings during their final molt into adulthood. Adult locusts are fully winged, which significantly changes their appearance due to the larger, more visible wings, distinguishing them from the nymphs in images.",
    "url": "https://en.wikipedia.org/wiki/Tarnished_plant_bug"
  },
  "50": {
    "label": "legume blister beetle",
    "original_knowledge": "Lytta polita, the bronze blister beetle, is a species of blister beetle in the family Meloidae. It is found in North America.",
    "visual_knowledge": "The legume blister beetle, specifically the bronze blister beetle, is visually distinctive due to its striking coloration and body structure. This beetle is characterized by its elongated and cylindrical body with a sleek and smooth surface. The coloration of the bronze blister beetle often includes metallic hues, ranging from bronzy tones to darker, more subdued greens, which can give it a glossy appearance in the light. This metallic sheen is a key distinguishing feature that can help an image recognition system differentiate it from various other beetles.\n\nIn terms of size, the legume blister beetle typically measures around 10 to 20 millimeters in length, making it a moderate-sized insect compared to other beetles. Its body structure is segmented into three primary parts: the head, thorax, and abdomen. The head is prominent with large, dark, and somewhat bulging eyes that give it a slightly intimidating look. The antennae are long and filiform, often exceeding the length of the head, and are segmented, adding to the beetle's distinguished appearance.\n\nA distinctive feature of the legume blister beetle is its soft, flexible elytra (wing covers) which are not as hardened as seen in other beetles. These elytra do not completely cover the abdomen, often leaving the tip exposed, which can be a characteristic feature for visual systems to note. Additionally, while resting, the legs are typically tucked underneath the body but are visible when the beetle is in motion. The legs are slender and relatively long, aiding in their mobility across varied surfaces.\n\nWhen differentiating the bronze blister beetle from similar insects, note that its metallic sheen and relatively soft wing covers contrast with the harder, often less lustrous elytra found in many similar-sized beetles. Also, its somewhat rear-exposed abdominal segment sets it apart from beetles with fully protected abdomens.\n\nIn habitat contexts, the legume blister beetle is often associated with agricultural environments, particularly in fields where legumes such as alfalfa and clover are present. Images might frequently capture these beetles on or near foliage, flowers, or stems of these plants, making this environmental context another potential identifying cue.\n\nThe life cycle stages of the legume blister beetle can also offer visual distinctions. The larvae are typically more elongated and caterpillar-like, with segments that are less glossy compared to the adults. They are usually found in soil or plant debris, which might be relevant for image recognition systems aiming to classify them at different developmental stages. Overall, the adult's metallic sheen, body shape, and typical environments are key visual identifiers for this species.",
    "url": "https://en.wikipedia.org/wiki/Lytta_polita"
  },
  "52": {
    "label": "therioaphis maculata Buckton",
    "original_knowledge": "Blister beetles are beetles of the family Meloidae, so called for their defensive secretion of a blistering agent, cantharidin. About 7,500 species are known worldwide. Many are conspicuous and some are aposematically colored, announcing their toxicity to would-be predators.",
    "visual_knowledge": "Therioaphis maculata Buckton, commonly known as the spotted alfalfa aphid, is a small insect notable for its distinct coloration and body shape that can aid in visual identification. The aphid typically measures about 1.5 to 2 mm in length, making it relatively small compared to other insects. Its body color is generally pale yellow to light green, offering a background for its characteristic darker spots which are scattered across its dorsum. These spots form a key identifying feature that sets it apart from other similar aphid species.\n\nIn terms of body structure, the spotted alfalfa aphid has a soft, pear-shaped body typical of aphids, with a somewhat bulbous abdomen that tapers towards both the head and tail ends. It possesses long, slender antennae that are typically segmented and extend outward from the head. The legs are delicate and spindly, with the hind legs slightly longer to aid in mobility.\n\nTo distinguish Therioaphis maculata from similar insects such as other aphid species, note its uniquely patterned dark spots. These spots are more pronounced than in related species, which may have a more uniform color or lack such distinct markings. Additionally, the presence of thin and transparent wings in winged adults is characteristic, although aphids often have both winged and wingless forms through their life cycle.\n\nWhen identifying images, consider the habitat context. The spotted alfalfa aphid is commonly found on alfalfa plants, often feeding on the underside of leaves. It may appear in images situated on clusters of alfalfa leaf stems, where its color allows it to blend partially into the foliage but its spot pattern makes it discernible.\n\nThroughout its life cycle, the spotted alfalfa aphid exhibits distinct stages, though immatures or nymphs closely resemble the adults in shape and color, merely lacking the wings. Winged adults may be seen in migration phases, while the wingless forms predominate when populations establish on plants.\n\nBy focusing on these visual cues—the pale coloration with dark spots, the pear-shaped body, and the association with alfalfa plants—a robust image recognition system can successfully identify Therioaphis maculata Buckton.",
    "url": "https://en.wikipedia.org/wiki/Blister_beetle"
  },
  "55": {
    "label": "alfalfa seed chalcid",
    "original_knowledge": "Thrips are minute, slender insects with fringed wings and unique asymmetrical mouthparts. Entomologists have described approximately 7,700 species. They fly only weakly and their feathery wings are unsuitable for conventional flight; instead, thrips exploit an unusual mechanism, clap and fling, to create lift using an unsteady circulation pattern with transient vortices near the wings.",
    "visual_knowledge": "The alfalfa seed chalcid (Bruchophagus roddi) is a small insect that can be visually identified by several key characteristics. The adult chalcids are tiny, generally measuring around 2 to 3 millimeters in length. Their bodies are compact and somewhat oval in shape. The coloration of adults is typically a dark metallic black or dark brown, which may give off a slight iridescence under certain lighting conditions. The wings are clear but may appear slightly smoky, featuring a modest iridescent quality.\n\nThe body structure of the alfalfa seed chalcid includes well-defined segments, with the thorax appearing robust in comparison to the relatively small abdomen. The head is small but distinct, with short antennae that often curve slightly forward. The legs are slender and proportionate, aiding movement and stability rather than significant jumping or flying capabilities.\n\nAn essential distinguishing feature of the alfalfa seed chalcid is its ovipositor, which is a key structure in females. The ovipositor is often visible, extending from the rear of the abdomen, and is used for depositing eggs within alfalfa seeds. This feature can be used to differentiate them from similar seed-feeding insects that may lack such an ovipositor or have different ovipositor structures.\n\nIn terms of habitat, images may capture alfalfa seed chalcids in settings where alfalfa plants are present, particularly focusing on seed pods. The insect's presence near or on seed pods can help in visual identification, especially when observing for tiny exit holes, which are indicative of emerging adults.\n\nThe life cycle of the alfalfa seed chalcid includes distinct stages, most notably the larval stage, which takes place inside alfalfa seeds. While difficult to spot without cutting into seeds, awareness of this stage is crucial. The larva is legless, white to cream-colored, and C-shaped, occupying the space within the seed and feeding on its contents.\n\nIn summary, visual identification of the alfalfa seed chalcid involves recognizing its small size, metallic coloration, distinct ovipositor in females, association with alfalfa seed pods, and translucent wings. Observing these characteristics, particularly in the context of alfalfa habitats, can aid in accurately distinguishing this insect from other similar species.",
    "url": "https://en.wikipedia.org/wiki/Thrips"
  },
  "57": {
    "label": "Apolygus lucorum",
    "original_knowledge": "Pieris canidia, the Indian cabbage white, is a butterfly in the family Pieridae found in India, Nepal and Indochina. Pieris rapae is one of the most closely related species in the Pieridae.",
    "visual_knowledge": "To accurately identify Apolygus lucorum in images, focus on the following visual characteristics and contexts:\n\n1. **Visual Appearance**: Apolygus lucorum, commonly known as the green plant bug, has a predominantly green body that may appear variably depending on the light and its immediate surroundings. The bug's color can range from bright green to a slightly yellowish-green hue, which helps it blend into foliage. The insect is approximately 5 to 6 mm in length, with an oval and slightly flattened shape that aids in its camouflage among leaves.\n\n2. **Body Structure and Parts**: Its body structure is typical of the Miridae family, with a soft, elongated body. The insect possesses large, prominent compound eyes that are usually darker, helping distinguish it from other smaller or more subtle-eyed species. The wings are transparent but with a hint of green and rest flat over the abdomen. The antennae are relatively long and thin, appearing in multiple segments, which can sometimes be critical for identification against background vegetation.\n\n3. **Comparative Features**: When comparing Apolygus lucorum to similar mirid bugs, note the lack of any strong distinct patterns or markings commonly seen in other plant bugs. Its uniform coloration contrasts with species with more pronounced stripes or spots. Furthermore, its smooth body surface without any ridges or bumps helps differentiate it from more robust or textured mirids.\n\n4. **Habitat Context**: Imagery likely to contain Apolygus lucorum often depicts it on green parts of host plants, such as leaves and stems. Its preference for cotton, fruit trees, and various crops means images will frequently include agricultural contexts. Look for a verdant backdrop, as the insect uses its coloration as camouflage within lush green environments.\n\n5. **Life Cycle Stages**: In its nymph stage, Apolygus lucorum is smaller, with a more translucent green body, lacking wings and with a generally softer appearance than adults. Nymphs can be harder to spot due to their lesser size and wingless form but may be found tightly clustered around new growths or buds where they feed.\n\nBy focusing on these visual indicators, an image recognition system can better identify Apolygus lucorum within varied contexts and alongside closely related or similar-looking species.",
    "url": "https://en.wikipedia.org/wiki/Pieris_canidia"
  },
  "58": {
    "label": "Limacodidae",
    "original_knowledge": "Apolygus lucorum is a species of true bug in the Miridae family. It can be found everywhere in Europe except for Albania, Bulgaria, Iceland, Malta, and Portugal.\nand much of the Mediterranean basin, then east across the Palearctic to China and Japan.\n",
    "visual_knowledge": "Limacodidae, commonly known as slug caterpillar moths, exhibit some striking and distinct visual features that can aid in their identification. The adult moths are generally small to medium-sized, with wingspans ranging from about 10 to 50 millimeters. Their wings are typically rounded and broad, often displaying muted earthy tones such as browns, greens, and grays, sometimes adorned with intricate patterns and lines that can act as camouflage mimicking leaves or bark. The body is stout and covered with dense scales, giving it a furry appearance.\n\nThe caterpillar stage of Limacodidae is especially notable for identification. These larvae are often flattened and resemble slugs, lacking the typical pro-legs found on many other caterpillars. The larvae can display a wide range of vivid colors like bright greens or yellows, sometimes with transparent or translucent bodies that reveal internal structures. They often have distinctive markings such as stripes or dots and are frequently adorned with unique, often intimidating, spiny or bristly projections that can be vibrant in color and serve as a warning to predators.\n\nIn comparison to similar insect families, Limacodidae larvae's flattened slug-like bodies and the absence of pro-legs make them stand out. This differentiates them from other moth and butterfly caterpillars that typically have a cylindrical body shape and distinct pro-legs. Adult Limacodidae moths can be mistaken for other drab moth species, but their wing patterns and texture are helpful markers.\n\nThe habitat context for images of Limacodidae can vary, as adults and larvae are typically found in lush, leafy environments. You might find them on broadleaf trees, shrubs, and occasionally crawling on the forest floor. They are adept at blending into their surroundings, making them somewhat challenging to spot in dense leaf litter or on foliage, but the caterpillars’ bright colors can stand out against more monochrome backgrounds.\n\nLife cycle stages to observe include the primary stages of larvae and adult moths. Larvae are most visually distinctive with their unique form and defensive adaptations, whereas the adult moths, while sometimes more subdued in color, show variations in patterning that can be crucial for identification. Identifying the cocoon stage may also be relevant as Limacodidae create distinctive oval or globular cocoons that can be covered with silk and often integrated with leaves or plant debris.",
    "url": "https://en.wikipedia.org/wiki/Apolygus_lucorum"
  },
  "59": {
    "label": "Viteus vitifoliae",
    "original_knowledge": "The Limacodidae or Eucleidae are a family of moths in the superfamily Zygaenoidea or the Cossoidea; the placement is in dispute. They are often called slug moths because their caterpillars bear a distinct resemblance to slugs. They are also called cup moths because of the shape of their cocoons.",
    "visual_knowledge": "Viteus vitifoliae, also known as grape phylloxera, is a small insect with distinct visual characteristics that can aid in identification. Adult phylloxera are typically tiny, ranging from about 0.3 to 1.5 mm in length. They have a soft-bodied and oval-shaped appearance, which is often covered by a yellowish to brown coloration. This coloration can aid in distinguishing them from other similar insects found on grapevines. The adult body structure is somewhat bulbous, possessing a small head and a largely inflated abdomen, giving it a distinctive tick-like appearance.\n\nThe limbs and appendages of Viteus vitifoliae are relatively short and inconspicuous, with the legs appearing spindly compared to the more robust body. They have segmented antennae that can be observed protruding from the head. The nymphs, which are a crucial life cycle stage, resemble the adults but are smaller and more translucent, often taking on a paler yellow hue. As they mature, the color becomes more pronounced, making size and coloration key indicators in distinguishing between nymph and mature stages.\n\nComparatively, Viteus vitifoliae can be mistaken for aphids due to their size and body shape but are differentiated by their lack of cornicles (the tubular structures common to many aphids). Additionally, unlike many other insects of similar habitats, the phylloxera do not exhibit any noticeable wings, as the adult stage that causes damage to grapevines is wingless.\n\nIn terms of habitat, grape phylloxera are most commonly identified on the leaves and roots of grapevines, which serve as their primary feeding source. This means images of Viteus vitifoliae may often involve close inspection of grapevine foliage, especially the undersides of leaves where they often form galls. These galls are a particularly significant visual indicator, appearing as small swellings or deformations that are caused by the feeding activity of the insect.\n\nDuring their life cycle, the presence of galls on leaves is indicative of the leaf-galling form, which is a noticeable visual marker. Root-galling forms, while more challenging to observe in images, can cause swellings and knots underground, which may not be visually detectable unless roots are exposed. Therefore, leaf gall formations become the primary identification feature in habitat context images, and monitoring for changes to the foliage of grapevines is crucial for visual identification of this pest.",
    "url": "https://en.wikipedia.org/wiki/Limacodidae"
  },
  "61": {
    "label": "Brevipoalpus lewisi McGregor",
    "original_knowledge": "Eriophyes vitis, also known as grape erineum mite or blister mite, is a mite species in the genus Eriophyes infecting grape leaves. E. vitis has spread worldwide and has three distinct strains: a leaf-curling strain, a blister-causing strain, and a strain that stunts the growth of buds. It is a vector of grapevine pinot gris virus and grapevine inner necrosis virus.",
    "visual_knowledge": "Brevipoalpus lewisi McGregor is a flat mite species characterized by its small size and distinctive physical features, suited for identification in images. The mites typically measure around 0.2-0.3 mm in length, making them challenging to observe without magnification. Visually, they exhibit a flattened oval body shape that is wider than it is long, giving them a somewhat squat appearance.\n\nIn terms of color, Brevipoalpus lewisi McGregor mites are usually reddish-brown, although variations may include a more orange hue. This coloration helps them to stand out against the lighter surfaces of leaves they infest. The presence of fine setae (hair-like structures) on their bodies is notable, often appearing as small, translucent projections when viewed with sufficient magnification.\n\nThe body structure includes distinctly segmented legs that are relatively short but robust, which is typical of many flat mites. They generally have four pairs of legs situated towards the front of their bodies, which contribute to their mobility across plant surfaces. Their gnathosoma (mouthpart region) is often concealed from a dorsal view due to the broadness of their bodies.\n\nWhen comparing with other similar mites, Brevipoalpus lewisi can be distinguished by its unique combination of size, color, and body flatness. Most notably, they differ from spider mites which may have a more rounded body and webbing behavior.\n\nHabitat context is crucial for identification in images; Brevipoalpus lewisi is typically found on the surface of leaves, often in clusters. These mites often create significant damage to plants by puncturing cells to feed, leading to discoloration and leaf scarring. Such damage patterns, including stippling or bronzing on leaves, are important visual clues.\n\nIn terms of life cycle stages, the immature mites, known as nymphs, closely resemble adults but are paler and even smaller, making them less distinct in images. Eggs tend to be round and clear to pale in color, often laid in clusters on the underside of leaves. Observing both adults and nymphs together, often with these eggs, can be a visual cue for identification.",
    "url": "https://en.wikipedia.org/wiki/Eriophyes_vitis"
  },
  "67": {
    "label": "Lycorma delicatula",
    "original_knowledge": "Ampelophaga is a genus of moths in the family Sphingidae.",
    "visual_knowledge": "Lycorma delicatula, commonly known as the spotted lanternfly, has a striking visual appearance that makes it relatively easy to distinguish. The adult insect measures approximately 1 inch (about 2.5 cm) in length. It features a distinctive wing coloration and pattern that serves as its primary identifying characteristic. The forewings are a light gray color with a subtle tint of cream, adorned with a series of black spots distributed evenly across the surface. These spots vary in size and are irregular, giving the wings a speckled appearance. When at rest, the forewings create a tent-like shape over the body, adding to its distinctive silhouette.\n\nThe hindwings, which are usually hidden when the insect is at rest, are more vibrant. They have a stark contrast of bright red near the base, which fades to black towards the outer margins. A distinguishing feature is a white stripe band that separates the red and black sections of the hindwings. The abdomen of the spotted lanternfly is notably yellow with black bands, adding to its colorful appearance.\n\nBody structure features a small head compared to its body size, which is primarily black and marked with short, segmented antennae. The legs are predominantly black with hints of white or cream on the tarsi, particularly noticeable in the forelegs.\n\nIn its nymph stages, the spotted lanternfly undergoes dramatic changes in appearance that are important for visual identification. Early-stage nymphs are small and black with conspicuous white spots, making them distinct from other species. As they mature, the nymphs transition into bright red with black and white markings, a characteristic phase that is commonly observed in images.\n\nThe common habitat settings in which the spotted lanternfly might appear include areas dense with vegetation, such as shrubs, trees, and vines. It is often found on tree trunks, canopies, and sometimes on the ground, particularly in orchards or gardens with abundant plant life. This can aid in contextual recognition, as images depicting such environments may be indicative of the spotted lanternfly's presence.",
    "url": "https://en.wikipedia.org/wiki/Ampelophaga"
  },
  "68": {
    "label": "Xylotrechus",
    "original_knowledge": "The spotted lanternfly is a planthopper indigenous to parts of China and Vietnam. It has spread invasively to Japan, South Korea, and the United States, where it is often referred to by the acronym \"SLF\". Its preferred host is the tree of heaven, but it also feeds on other trees, and on crops including soybean, grapes, stone fruits, and Malus spp. In its native habitat, L. delicatula populations are regulated by parasitic wasps.",
    "visual_knowledge": "The genus Xylotrechus is characterized by its moderately elongated beetle body structure, typical of the longhorn beetle family (Cerambycidae). Adult Xylotrechus beetles typically range in length from approximately 8 to 20 millimeters, with a broad, slightly flattened form that tapers towards the rear. This shape, combined with their elongated antennae, contributes to a distinctive profile easily discernable in images.\n\nIn terms of color, Xylotrechus beetles often exhibit a striking pattern of contrasting hues. Common hues include black or dark brown bodies adorned with yellow, cream, or white longitudinal stripes or spots across the elytra and thorax. These markings can create an eye-catching pattern that helps in distinguishing them from other beetles. The antennae are often banded with lighter and darker segments, mirroring the body patterning and adding to the natural camouflage effect against tree bark.\n\nThe body structure includes a head that is typically dark and slightly wider, equipped with prominent mandibles, and compound eyes that wrap around slightly on the sides of the head. The thorax is usually rounded or slightly rectangular, leading into the elytra which covers the wings and is characterized by ridged lines or dots that follow the shape of the beetle.\n\nCompared to other beetles, the key comparative feature in identifying Xylotrechus within images is the long, curved antennae that can extend beyond the length of the beetle's body. This feature is significantly more pronounced than in beetles outside the Cerambycidae family.\n\nIn terms of habitat, Xylotrechus is commonly associated with wooded areas and can often be found on the bark or branches of deciduous trees. This context can appear in images as they might be photographed amidst tree bark or foliage, which serves as their natural environment.\n\nDistinct life cycle stages of Xylotrechus that are visually unique primarily include the adult beetle form, as the larvae and pupae tend to remain hidden within wood and therefore don’t offer much in visual identification through photography. However, larvae are cream-colored, legless grubs, typically with a slightly C-shaped body, and they can sometimes be observed when infested wood is split open.\n\nCapturing these detailed visual characteristics can greatly aid an image recognition system in identifying Xylotrechus beetles accurately, especially by focusing on their color patterns, antennae structure, and preferred environmental settings.",
    "url": "https://en.wikipedia.org/wiki/Spotted_lanternfly"
  },
  "69": {
    "label": "Cicadella viridis",
    "original_knowledge": "Xylotrechus a genus of longhorned beetles of the family Cerambycidae, containing some 200 described species.",
    "visual_knowledge": "Cicadella viridis, commonly known as the Green Leafhopper, is a small but distinct insect with several features that facilitate its identification. \n\n**Visual Appearance:**\nCicadella viridis exhibits a strikingly vivid appearance with a predominant green coloration that varies from bright lime to a deeper, lush green. The coloring can sometimes shift depending on the light and the environment it inhabits, contributing to its camouflage among green foliage. The contrasting textures and shades make it a visually profound subject in images. This insect typically measures between 6 to 7mm in length, making it relatively small but still distinguishable in high-resolution imagery.\n\n**Body Structure and Parts:**\nThe body of Cicadella viridis is elongated and wedge-shaped, typical of leafhoppers. Its most notable features include a flat, triangular head and large, prominent eyes which are often red or brownish in hue, that lie on either side. The wings are semi-transparent and fold over the body in a tent-like fashion when at rest, contributing to its streamlined shape. These wings can show a slight variation in color, sometimes exhibiting subtle yellow or bluish tints depending on the moult stage of the insect.\n\n**Distinguishing Marks:**\nA defining trait of Cicadella viridis is the presence of two white to pale yellow spots located on the upper section of the wings, near the head. These spots can function as useful identifiers, particularly under close inspection in photographs. The legs of the insect are slim and usually possess fine spines that may also reflect light in images, adding nuance to its identification.\n\n**Comparative Features to Similar Insects:**\nWhen compared to other leafhoppers, Cicadella viridis is distinguished by its vibrant green coloration which is generally more uniform than the often mixed color patterns of similar species. The specific combination of green body color and wing spots helps differentiate it from the sometimes more variegated or earth-toned leafhoppers.\n\n**Habitat Context in Images:**\nCicadella viridis is often found associated with grasslands, meadows, and areas with abundant vegetation, which should be evident in images capturing this insect. They might be seen on grass blades or plant stems, blending with the green background due to their camouflaging capabilities, making habitat a crucial aspect of visual identification.\n\n**Life Cycle Stages with Distinct Visual Characteristics:**\nIn terms of developmental stages, the nymphs are smaller and lack wings, often appearing as small, bright green to pale yellowish-green creatures, which are key for identifying juveniles. These features change as they molt, eventually developing the characteristic wing form at adulthood that allows for definitive identification. In photographs of multiple individuals, the size difference between adult and nymph stages can be quite apparent and should be considered in identification processes. \n\nCicadella viridis is a visually identifiable species due to its unique coloration, specific body structure, and distinctive marks, allowing image recognition systems to capitalize on these traits for accurate insect classification.",
    "url": "https://en.wikipedia.org/wiki/Xylotrechus"
  },
  "70": {
    "label": "Miridae",
    "original_knowledge": "Cicadella viridis, sometimes called the \"green leafhopper\", is a species of European leafhoppers belonging to the subfamily Cicadellinae.",
    "visual_knowledge": "Miridae, commonly referred to as plant bugs, are small insects typically measuring between 3 to 15 millimeters in length. They exhibit a wide array of colors, although many species display shades of green, brown, or yellow, often with distinctive patterns or markings that can aid in visual identification. The body shape of Miridae is generally elongated and somewhat oval or elliptical. A distinguishing feature of these insects is their cuneus, or the small triangular section at the end of their forewings, which is often a different color or shade, setting them apart from similar insects.\n\nThe Miridae possess a characteristic body structure with well-defined body parts. They have a head with large, noticeable compound eyes and slender, segmented antennae that are often longer than the head itself. Their mouthparts are adapted for piercing and sucking, typical of heteropteran insects, and may be partially visible as a slender beak-like structure beneath the head. The wings are typically held flat over the body when at rest, with the forewings displaying a membranous texture at the rear and more leathery towards the front.\n\nWhen comparing Miridae to similar insects such as cicadas or aphids, several visual cues stand out. Unlike cicadas, which have broad, membranous wings, Miridae display a clear differentiation between the leathery and membranous sections of their forewings. Also, Miridae are generally smaller and less robust in comparison to cicadas. Compared to aphids, Miridae have a more elongated and defined cuneus and a more active appearance due to their movement and body build.\n\nThe habitat context for Miridae, crucial for identification in images, often includes various types of vegetation. They are commonly found on leaves, stems, and sometimes flowers, as they feed on plant juices. This vegetation backdrop, combined with their camouflage coloration, often makes them blend into their surroundings. However, they may be more visible against contrasting plant surfaces or when they congregate in large numbers.\n\nRegarding life cycle stages, nymphs of Miridae might appear in images, prompting different identification cues compared to adults. Nymphs resemble smaller, wingless versions of the adults, often with a more robust or rounded body given their undeveloped wings. Their color patterns are generally consistent with adults, but the absence of a fully formed cuneus in their wing pads can be a distinguishing factor.\n\nBy focusing on these visual characteristics, an image recognition system can more effectively identify members of the Miridae family in various contexts, aiding in accurate classification and study of these diverse and widespread insects.",
    "url": "https://en.wikipedia.org/wiki/Cicadella_viridis"
  },
  "71": {
    "label": "Trialeurodes vaporariorum",
    "original_knowledge": "The Miridae are a large and diverse insect family at one time known by the taxonomic synonym Capsidae. Species in the family may be referred to as capsid bugs or \"mirid bugs\". Common names include plant bugs, leaf bugs, and grass bugs. It is the largest family of true bugs belonging to the suborder Heteroptera; it includes over 10,000 known species, and new ones are being described constantly. Most widely known mirids are species that are notorious agricultural pests that pierce plant tissues, feed on the sap, and sometimes transmit viral plant diseases. Some species however, are predatory.",
    "visual_knowledge": "### Visual Appearance:\nTrialeurodes vaporariorum, commonly known as the greenhouse whitefly, exhibits a striking white coloration, which is its most distinguishing feature. Adult individuals have a powdery, waxy surface that gives the wings a bright white, opaque appearance. The wings are held tent-like over the body when at rest, creating a triangular shape that is typical of whiteflies. Adults are small, measuring about 1 to 2 mm in length, which is significantly smaller compared to other larger insects but larger than some related whitefly species. \n\n### Body Structure and Parts:\nThe whitefly's body is soft and delicate, characterized by two pairs of wings that are the same size, further emphasizing the symmetrically tented positioning. The insect's head is relatively small with short antennae, and small, black compound eyes that can be subtle and difficult to detect at first glance. The legs are slender and relatively short, adapted more for clinging than jumping or running.\n\n### Comparative Features:\nTrialeurodes vaporariorum may be confused with other whitefly species; however, its powdery white wax coating is denser and more uniform than those on other similar species. Unlike closely related species that may have clear wings with patterns, T. vaporariorum's wings are consistently opaque white, which serves as a primary distinguishing feature in comparative analysis.\n\n### Habitat Context:\nImages depicting Trialeurodes vaporariorum will typically show these insects clustered on the underside of leaves, particularly in greenhouse environments where they feed on a variety of plant species. The background often includes plant foliage, especially those with soft, tender leaves typical in controlled agricultural settings like greenhouses. The presence of honeydew (a sticky substance secreted by the insect) and sooty mold could be notable visual cues in identifying this pest's habitat in the images.\n\n### Life Cycle Stages:\nThe lifecycle of Trialeurodes vaporariorum includes several stages, each with distinct visual characteristics. Eggs are tiny, oblong, and laid in circular patterns on the underside of leaves, appearing pale yellow initially. The nymphs are translucent or light yellow and have a flattened oval shape, initially appearing as small white or yellowish specks on leaves during early instar stages. As they progress to the pupal stage, they become more stationary, appearing as slightly raised and more structured scale-like formations. Adults emerge displaying the characteristic white wings. Each life stage may typically be identified by these distinct visual traits.",
    "url": "https://en.wikipedia.org/wiki/Miridae"
  },
  "72": {
    "label": "Erythroneura apicalis",
    "original_knowledge": "Trialeurodes vaporariorum, commonly known as the glasshouse whitefly or greenhouse whitefly, is an insect that inhabits the world's temperate regions. Like various other whiteflies, it is a primary insect pest of many fruit, vegetable and ornamental crops. It is frequently found in glasshouses (greenhouses), polytunnels, and other protected horticultural environments. Adults are 1–2 mm in length, with yellowish bodies and four wax-coated wings held near parallel to the leaf surface.",
    "visual_knowledge": "Erythroneura apicalis, commonly identified among leafhoppers, can be recognized by its distinct visual attributes which are crucial for image-based identification systems. This insect typically showcases a vibrant and contrasting coloration that aids its identification. Adult Erythroneura apicalis are small, usually measuring about 3-4 mm in length, making them slightly challenging to spot with the naked eye, depending on their environment.\n\nVisually, Erythroneura apicalis exhibits a striking coloration pattern. Predominantly, their body carries hues of yellow or cream, contrasted with vivid red markings. This pattern typically presents as red longitudinal lines or patches across the wings and body area, often forming distinct shapes which can vary slightly but are generally consistent in their arrangement. These red marks are a key differentiator from other similarly sized leafhoppers.\n\nStructurally, the body of Erythroneura apicalis is elongated and wedge-shaped, a characteristic trait among leafhoppers, facilitating streamlined movement through their habitats. Their wings, when at rest, lay flat over their body, enhancing the visibility of their coloration pattern. The legs are slender and adapted for jumping, which is typical of leafhoppers. The head is small, with prominent eyes that can be seen bulging from the sides.\n\nTo further distinguish Erythroneura apicalis from similar leafhoppers, attention should be given to their wing venation. The vein patterns are often less conspicuous due to the striking red markings but remain a critical identification feature.\n\nThe habitat context for Erythroneura apicalis frequently involves deciduous trees and shrubs, where they are often found dwelling on the undersides of leaves. This positioning might be evident in visual data where the leafhopper appears camouflaged against the leaf surfaces yet stands out due to its distinctive coloration.\n\nRegarding life cycle stages, nymphs of Erythroneura apicalis might be identified by their smaller size, lack of full wing development, and less pronounced color markings compared to adults. They are typically paler and more translucent, blending into their host leaf's texture and color until they reach maturity.\n\nIn visual recognition software, the combination of size, vibrant red and yellow coloration patterns, distinct body shape, and typical habitat position should be leveraged for accurate identification of Erythroneura apicalis.",
    "url": "https://en.wikipedia.org/wiki/Greenhouse_whitefly"
  },
  "74": {
    "label": "Panonchus citri McGregor",
    "original_knowledge": "Papilio xuthus, the Asian swallowtail, Chinese yellow swallowtail, Japanese Swallowtail, Korean Swallowtail or Xuthus swallowtail, is a yellow-colored, medium to large sized swallowtail butterfly found in northeast Asia, northern Myanmar, southern China, Taiwan, the Korean Peninsula, Japan, Siberia and the Hawaiian Islands. The butterfly has been observed thrice in New Zealand. Once in Dunedin in 1996 emerging from a chrysalis in a car yard specializing in Japanese used cars; it is thought the chrysalis arrived through one of the cars. and later in Auckland in 2011 and 2016. It was also recorded in the state of Arunachal Pradesh, India, in 2014.",
    "visual_knowledge": "**Visual Appearance:**\nPanonchus citri McGregor, commonly known as the citrus red mite, typically exhibits a reddish to brownish hue, which can appear darker or lighter depending on lighting conditions. The body size is quite small, often less than 0.5 mm in diameter, making it challenging to observe with the naked eye. An identification feature is the overall oval shape of the body, which is slightly flattened and covered with fine hair, giving it a textured appearance at higher magnifications.\n\n**Body Structure and Parts:**\nThe body of Panonchus citri is divided into two distinct parts: the cephalothorax and abdomen, although they appear fused in this species. Fresh individuals may show subtle banding across the body. The cephalothorax features two pairs of legs, as is standard for arachnid relatives, which they belong to, with these legs covered in small spines. The back of the mite holds distinctive, tiny tactile setae (hairs) that are arranged in an approximately symmetric pattern.\n\n**Comparative Features to Similar Insects:**\nWhen compared to other mites, the citrus red mite stands out due to its smaller size and more uniform reddish coloration. Unlike the two-spotted spider mite (Tetranychus urticae), which has noticeable dark spots on its body, Panonchus citri lacks such prominent marks. Also, when observed under a microscope, their red color is more consistent in comparison to the varying tones of other mite species.\n\n**Habitat Context:**\nImages featuring Panonchus citri often show them on the undersides of citrus leaves, where they are most frequently found. These leaves might show signs of stippling or a rust-like appearance, evidence of feeding damage that includes discoloration and scarring. The mite is commonly seen amongst fine webbing produced as they feed, though less so than other web-spinning mites.\n\n**Life Cycle Stages with Distinct Visual Characteristics:**\nNotably, the life cycle of Panonchus citri includes stages where juveniles, or nymphs, are visually distinguishable. The nymphs are similar in shape to adults but are often lighter in color, appearing more orange than red. The eggs, which might be observable in detailed images, are spherical and pale, often seen clumped together on leaf surfaces or near the webbing produced by feeding mites. This clustering, combined with the pale egg color, can be a defining visual cue for identification in images.",
    "url": "https://en.wikipedia.org/wiki/Papilio_xuthus"
  },
  "79": {
    "label": "Chrysomphalus aonidum",
    "original_knowledge": "Ceroplastes rubens, known generally as the red wax scale or pink wax scale, is a species of soft scale insect in the family Coccidae. It is native to Australia but has been introduced to other countries, including New Caledonia, Japan, China, Poland and the United States.",
    "visual_knowledge": "Chrysomphalus aonidum, commonly known as the Florida red scale, displays several key visual characteristics suitable for insect image recognition. Adult females are relatively small, generally measuring about 1.5 to 2 mm in diameter. Their body has a circular, flattened appearance with a prominent shield-like scale covering. This scale is typically reddish-brown to dark brown, often appearing slightly darker in the center with a lighter, concentric ring surrounding it, resembling a target or a bullseye pattern. The shield may possess a glossy surface texture, contributing to its distinctiveness against the foliage it inhabits.\n\nThe insect's body structure consists of segmentation that is not as visible due to the protective covering. However, the legs and antennae are either greatly reduced or absent, typical of many armored scales, making them less prominent features for identification. \n\nJuvenile stages, particularly the nymphs or 'crawlers', exhibit different visual characteristics. They are more oval and slightly yellowish at the early stage, which makes them less conspicuous compared to the adult stages but still distinct due to the size and coloration differences.\n\nWhen considering habitats in image contexts, Chrysomphalus aonidum is often found on the surfaces of host plants, especially on leaves, stems, and sometimes fruits. They may appear against green foliage or on more mature plant parts, making the stark color contrast between the reddish-brown scale and the green leaves a useful indicator.\n\nIn comparison to similar insects, Chrysomphalus aonidum might be confused with other scales but can be distinguished by its color patterns and size. Unlike some soft scales, this species lacks the powdery or waxy coatings and is more defined in its scale border, with the concentric ring pattern being especially diagnostic.\n\nOverall, to successfully identify Chrysomphalus aonidum in images, focus on the distinct size, shape, color pattern, and habitat context, particularly observing the conspicuous shield covering that typifies the mature insect against the backdrop of plant surfaces.",
    "url": "https://en.wikipedia.org/wiki/Ceroplastes_rubens"
  },
  "80": {
    "label": "Parlatoria zizyphus Lucus",
    "original_knowledge": "Chrysomphalus aonidum, known generally as Florida red scale, is a species of armored scale insect in the family Diaspididae. Other common names include the Egyptian black scale, circular black scale, and citrus black scale. It is found in Europe.",
    "visual_knowledge": "Parlatoria zizyphus Lucus is a small armored scale insect, typically measuring between 1.5 to 2 millimeters in diameter. Its body adopts a circular to slightly oval shape, characteristic of many scale insects. The insect possesses a hardened protective covering, usually a dull gray-brown color that can appear slightly translucent. This covering can help the insect blend into the bark of host plants, notably reducing its visibility against its environment.\n\nThe body structure is segmented and lies flat against the surface to which the insect is attached. The subtlety of its shape is accented by concentric rings that may be faintly visible, aiding in the camouflage against tree bark or similar surfaces. Occasionally, a darker, central spot can be observed, which distinguishes it from other scale insects that may present more uniform coloration.\n\nWhen comparing Parlatoria zizyphus Lucus to similar species such as Chrysomphalus aonidum (Florida red scale), it lacks the reddish or copper hues that highlight the latter. Parlatoria zizyphus Lucus does not exhibit the pronounced dark or circular markings that some citrus-attacking scales might display. This distinction is critical in differentiating it from other armored scales.\n\nIn terms of habitat, Parlatoria zizyphus Lucus is often located on the surfaces of fruit trees and other agricultural plants, clinging to branches, twigs, and occasionally the undersides of leaves. The background of an image featuring its habitat may include rough-textured white or gray barks, or areas densely populated with foliage.\n\nDuring its life cycle, the juvenile stages, known as crawlers, are slightly more mobile and may appear as tiny, white to pale-yellow dots moving across surfaces. These crawlers eventually settle and develop the same armored features as the adults. Images capturing various life stages will show the crawlers as visibly distinct for their mobility and lighter coloration before they mature into the stationary, darker armored adults.",
    "url": "https://en.wikipedia.org/wiki/Chrysomphalus_aonidum"
  },
  "83": {
    "label": "Tetradacus c Bactrocera minax",
    "original_knowledge": "Aleurocanthus spiniferus, the citrus spiny whitefly, is an insect native to Asia. It is considered an invasive pest, notably affecting citrus and tea plants. They are part of the whitefly family.",
    "visual_knowledge": "Tetradacus c Bactrocera minax, commonly known as the Chinese citrus fly, can be visually identified by several distinctive features. The adult fly typically measures between 7 to 10 millimeters in length. It exhibits a glossy black body with distinct patterns and metallic reflections. The thorax is primarily black with well-defined yellow stripes, which can aid in differentiating it from similar species. The abdomen is similarly black but with varying degrees of yellow markings, particularly prominent on the sides.\n\nThe wings of Bactrocera minax are clear with a broad, conspicuous dark band stretching along the edge, a key feature that often appears in captured images. The fly's head is usually yellowish-brown with large, prominent reddish-brown compound eyes, offering a stark contrast to the darker thorax. Antennae are short, yellowish, and partially covered by fine hairs, blending with the fly’s overall color scheme.\n\nAn important distinguishing feature is the ovipositor in females, which is pointed and black, used for laying eggs inside citrus fruits. In photographs, the ovipositor might be visible when the fly is at rest on fruits or foliage. Legs are predominantly black with lighter tarsi, which can sometimes be used to differentiate from other species if the same environment is photographed.\n\nBactrocera minax is often observed in citrus orchards as its larvae develop within citrus fruits. In environmental context, images may show this fly on or near citrus fruits, especially on damaged or rotting fruit, as adults emerge and congregate in such areas. This association with citrus fruits is critical and provides a necessary context for visual recognition systems.\n\nIn their life cycle, larvae are creamy white and might be visible within infested citrus fruits, often causing distinct patterns of damage. Pupae are found within the soil and are elongated with a brown casing, although these are less likely to be captured in standard images focusing on adults.\n\nWhile comparing to similar species, the specific arrangement of thoracic stripes, wing band width, and the shape of the ovipositor are critical points of differentiation. These should be particularly noted when refining the identification algorithms to ensure accuracy.",
    "url": "https://en.wikipedia.org/wiki/Aleurocanthus_spiniferus"
  },
  "91": {
    "label": "Aphis citricola Vander Goot",
    "original_knowledge": "Toxoptera aurantii, also known as both the black citrus aphid and brown citrus aphid, is a species of aphid in the superfamily Aphidoidea in the order Hemiptera. It is a true bug and sucks sap from plants. It is known to hosts in well over 150+ plant species.",
    "visual_knowledge": "### Visual Appearance\n\nAphis citricola Vander Goot, commonly known as the spirea aphid, can be identified by its small size, typically measuring between 1.8 to 2.6 millimeters in length. The body color ranges from light green to yellow-green, though some adults may appear a darker green or reddish hue. These color variations can be a crucial factor in real-world image identification, depending on the host plant and environmental conditions.\n\n### Body Structure and Parts\n\nThe insect possesses a soft, pear-shaped body, a trademark of many aphids. It has a pair of cornicles (tube-like structures) protruding from the back of its abdomen, which is a distinguishing feature of the species. The legs are relatively slender and match the body color, helping it blend with the plant stems. The antennae are notably long in relation to its body, segmented, and are often darker towards the tips, contributing to its identification. Another distinctive feature is its transparent wings, which are laid flat over the body when present in winged adults (alates).\n\n### Comparative Features to Similar Insects\n\nCompared to similar species such as Toxoptera aurantii (black citrus aphid), Aphis citricola lacks the dark, glossy appearance. Instead, its more muted and lighter color palette can serve as a visual distinguishing factor. Similarly, compared to the green peach aphid, which often presents a more uniform golden-green appearance, Aphis citricola's slightly chunky and segmented body shape, along with the distinct cornicles, are helpful identifiers.\n\n### Habitat Context\n\nAphis citricola is frequently found on the underside of young leaves or shoots of citrus plants and other host plants such as spirea or apple trees. In images, these settings are characterized by clusters of aphids congregating on new growths or flowering parts of the plant, often with visible signs of honeydew, which can attract sooty mold. Observing plant type and growth stage in conjunction with aphid characteristics is key for accurate identification in visuals.\n\n### Life Cycle Stages with Distinct Visual Characteristics\n\nThe aphid exhibits several life stages. Early nymphs resemble smaller adults, lacking wings, and are generally paler with less distinct body segmentation. Winged adults (alates) emerge when populations become dense, characterized by full-sized wings and more pronounced body segmentation. Appearance changes slightly during different plant bunges; color may influence visibility on the aphid’s preferred citrus habitats. Recognizing these stages, particularly differences in wing presence and body size, is crucial for visual classification.",
    "url": "https://en.wikipedia.org/wiki/Toxoptera_aurantii"
  },
  "98": {
    "label": "Mango flat beak leafhopper",
    "original_knowledge": "Chlumetia transversa, the mango shoot borer, is a moth of the family Euteliidae. The species was first described by Francis Walker in 1863. It is a widely distributed across Indo-Australian tropical countries far east to Solomon Islands.",
    "visual_knowledge": "The Mango flat beak leafhopper, a visually distinctive insect, is characterized by its compact and laterally flattened body which aids in its identification. Typically, it measures around 4 to 8 millimeters in length, contributing to its relatively small stature compared to other leafhoppers. The body is predominantly a vibrant green color, allowing it to blend seamlessly with its leafy surroundings, though depending on lighting and maturity, it might display subtle variations of yellowish-green tones.\n\nThe head of the Mango flat beak leafhopper boasts a unique shape, often described as wedge-like, and includes a prominent flat beak or rostrum that extends forward, a feature that is particularly useful in distinguishing it from similar species. Its wings, when at rest, are held roof-like over the body and exhibit translucent qualities, sometimes with faint venation that might be visible in high-resolution images.\n\nEye structure is another distinctive feature, with the leafhopper displaying prominent compound eyes that are typically reddish-brown. These eyes are positioned on the sides of the head, offering a wide field of vision which could appear as a distinctive trait under magnification.\n\nIn comparing the Mango flat beak leafhopper to other similar insects, its more pronounced beak or rostrum, combined with the particular coloration and pattern of its wings, plays a crucial role in differentiation. The body shape is less elongated compared to other leafhoppers, contributing to its unique appearance.\n\nWithin its habitat context, images might capture the insect on mango leaves or stems, often blending into the background due to its green coloration. The leafhopper's presence often correlates with signs of plant distress, such as discolored spots on leaves, but these indicators might not always be prominent in every image.\n\nIn terms of life cycle stages, the nymphs or immature stages of the Mango flat beak leafhopper are typically smaller and more translucent than adults, often lacking the full wing development seen in mature insects. These stages are critical for identification as they present a different set of visual characteristics, such as wing bud development and paler body coloration.\n\nIn summary, key visual identifiers for the Mango flat beak leafhopper include its small size, green body coloration, flat beak, roof-like wings, and distinctive compound eyes, all of which contribute to accurate recognition and differentiation in an image-based context.",
    "url": "https://en.wikipedia.org/wiki/Chlumetia_transversa"
  }
}